In [1]:
import pandas as pd

In [2]:
apples = pd.Series([3,2,0,1],index = ['a','b','c','d'])
oranges = pd.Series([3,2,0,1],index =['a','b','c','d'])

print(apples,"/n",oranges)
data ={"apples": apples, "oranges": oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

a    3
b    2
c    0
d    1
dtype: int64 /n a    3
b    2
c    0
d    1
dtype: int64
   apples  oranges
a       3        3
b       2        2
c       0        0
d       1        1

# DATA FRAME PART 4

In [3]:
state =['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada',]

data ={'state':state,
      'year'  : [2000, 2001, 2002, 2001, 2002, 2003],
      'pop'   : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame =pd.DataFrame(data,
                    index =['1st','2nd','3rd','4th','5th','6th'] )

print(frame)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [4]:
#frame .head jo hy top 5 ki value add karta hy

In [5]:
frame.head()

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9

In [6]:
# ager apko data ki heading my kuch changing karni hy to

In [7]:
frame = pd.DataFrame(data ,columns = ['year','state','pop'])
frame.head()

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [8]:
frame =pd.DataFrame(data,
                    columns =['year','pop','state','dept'],
index =['one','two','three','four','five','six'])

frame.head()

       year  pop   state dept
one    2000  1.5    Ohio  NaN
two    2001  1.7    Ohio  NaN
three  2002  3.6    Ohio  NaN
four   2001  2.4  Nevada  NaN
five   2002  2.9  Nevada  NaN

In [9]:
frame .columns
frame .index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

# A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:¶

# ڈیٹا فریم کے کالم کو سیریز کی طرح دوبارہ ڈکٹیٹ اشارے کے ذریعہ یا خصوصیت سے حاصل کیا جاسکتا ہے: #¶

In [10]:
#print(data)
#data['state']
frame['year']

#this is dictinsry like notation to access or extract
#dataframe columns data  

frame['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [11]:
#there is another method ,attribute style of accessing
#data frame data.
#ye attribute style hy upper wala state wala hy dono use kar sakte hain.

frame.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [12]:
#loc waly method my input bata na pary ga
frame.loc['one']

year     2000
pop       1.5
state    Ohio
dept      NaN
Name: one, dtype: object

# Columns can be modified by assignment. For example, the empty 'debt' column could be assigned a scalar value or an array of values:

In [15]:
#ager kisi khali row my value add kar ni o to

frame['dept']=16.2
frame.head()

       year  pop   state  dept
one    2000  1.5    Ohio  16.2
two    2001  1.7    Ohio  16.2
three  2002  3.6    Ohio  16.2
four   2001  2.4  Nevada  16.2
five   2002  2.9  Nevada  16.2

In [23]:
#import cell for code review 
import numpy as np
import pandas as pd
state = ['ohio','ohio','ohio','nevada','nevada','nevada']

data ={'state':state,
       'year' :[2000,2001,2002,2000,2001,2002,],
        'pop' :[1.5 ,1.7 ,3.6, 2.4 ,2.9, 3.2],}
frame2 = pd.DataFrame(data,columns =['year','state','pop','dept'],
                     
             
                    index =('0ne','two','three','four','five','six'))
                      
 #finding now for row in data frame

#ln k veriable my len ko save kar sakte hain
ln = len(frame2)
#print(frame2)
rng=np.arange(ln)
print(rng)
frame2['dept']=rng
frame2
#ln = len(frame2)#finding now for row in data frame

[0 1 2 3 4 5]

       year   state  pop  dept
0ne    2000    ohio  1.5     0
two    2001    ohio  1.7     1
three  2002    ohio  3.6     2
four   2000  nevada  2.4     3
five   2001  nevada  2.9     4
six    2002  nevada  3.2     5

# point to remember , inserting new values, needs to be match in length of dataFrame (number of elements)¶

# یاد رکھنا ، نئی اقدار شامل کرنا ، ڈیٹا فریم (عناصر کی تعداد) کی لمبائی میں مماثل ہونا ضروری ہے ¶#

In [24]:
val =pd.Series([-1.2,-1.5,-1.7,-1.2,-1.5,-1.7,2.2],
              index =['one','two','three','four','five','six','seven'])

frame2['dept'] = val
frame2

       year   state  pop  dept
0ne    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.5
three  2002    ohio  3.6  -1.7
four   2000  nevada  2.4  -1.2
five   2001  nevada  2.9  -1.5
six    2002  nevada  3.2  -1.7

In [25]:
#yaha per jo value ham ne nahi dali os jaga per nan a raha hy

In [26]:
val = pd.Series([-1.2, -1.5, -1.7, 2.6], index=['two', 'four', 'five', 'six'])
frame2['dept']=val
frame2

       year   state  pop  dept
0ne    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2000  nevada  2.4  -1.5
five   2001  nevada  2.9  -1.7
six    2002  nevada  3.2   2.6

# remmeber! index length must be equal to values ( or , do not provide index)¶

In [27]:
# Mind Teaser !!
#Assigning a column that already exist will ________ and 
# assigning a column that does not exist will ________

In [28]:
# how to reindex and usie of ffill value of parameter method 
import pandas as pd
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 3, 6])
print( obj3 )
# might create a new rows
#obj3 =obj3.reindex(range(9) )
#print(obj3)
obj3 =obj3.reindex(range(9), method='ffill' )
print(obj3)
#obj3 =obj3.reindex(range(2,11), method="ffill")
#obj3

0      blue
3    purple
6    yellow
dtype: object
0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

# function application and mapping

In [29]:
import numpy as np
import pandas as pd
frame=frame=pd.DataFrame(np.random.randn(4,3),
                        columns=list('bde'),
                        index=['utah','ohio','miami','oregeon'])
print(frame)
#print(np.abs(frame))
#print(frame['d'] . min())
#print(frame['d'] . max())
#print(frame['d'] . max() - frame['d'].min())

f = lambda x: x.max() - x.min() 
#df = frame.apply(f)
#print(df, type(df))
#df = frame.apply(f, axis=1)
#print(df)

def min_max(x):
   return pd.Series( [x.max() - x.min() ], index=['min-max'])    
df = frame.apply(min_max)
print(df, type(df))

                b         d         e
utah    -0.163523 -1.531663  0.572780
ohio     0.769889  0.428605 -1.247841
miami    0.536990  0.297162 -1.054225
oregeon  0.734221  0.451937 -1.975216
                b         d         e
min-max  0.933412  1.983601  2.547996 <class 'pandas.core.frame.DataFrame'>

# Arithmetic methods with fill values¶

In [30]:
df1 =pd.DataFrame(np.arange(12).reshape((3,4)),
                 columns=list('abcd'))
df2=pd.DataFrame(np.arange(20).reshape((4,5)),
                columns=list('abcde'))
print(df1)
print(df2)

df2.loc[1, 'b']=np.nan
print(df2)
df3=df1+df2
print()
print('direct+operation without fill_value')
#print(df3)

print('-------')
print()
# We can use add method for filling NaN cells with a value
# Nan will be replaced by 0 and then addition operation will apply
print('addition using method with replacing with 0')
df3=df1.add(df2,fill_value=0)
display(df3)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

direct+operation without fill_value
-------

addition using method with replacing with 0

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

# Operations between DataFrame and Series¶

In [31]:
import numpy as np
import pandas as pd

frame=pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns=list('bde'),
                  index=('utha','ohio','pak','rome'))

# iloc syntax
# iloc[start_row_pos:end_row_pos, start_column_pos: end_col_positin ]
Series=frame.iloc[0]
print(frame)
#print(Series)
#print(Series.values)
#print(Series.index)


# step 1: run above commands after uncomment
# step 2: comment above prints except the line contains print(frame)
# مرحلہ 1: بے قابو ہونے کے بعد کمانڈر کے اوپر چلائیں
# مرحلہ 2: پرنٹ کے اوپر تبصرہ کریں سوائے اس لائن کے پرنٹ (فریم

# write following lines
# and run the cell again
print('-------new Series')
series = pd.Series([1,2,3], index =list('bde') )
print(series.index, series.values)
print(frame - series)
# dateframe column names will be match with series index
# because its rows wise broadcasting operation

        b     d     e
utha  0.0   1.0   2.0
ohio  3.0   4.0   5.0
pak   6.0   7.0   8.0
rome  9.0  10.0  11.0
-------new Series
Index(['b', 'd', 'e'], dtype='object') [1 2 3]
        b    d    e
utha -1.0 -1.0 -1.0
ohio  2.0  2.0  2.0
pak   5.0  5.0  5.0
rome  8.0  8.0  8.0

# Selection with loc and iloc¶

In [32]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")
# in the loc method specify row label first 
# then specify column names
# remember! mutiple column names require array notation
#print( data_df.loc[['Colorado','Ohio'], ['two',  'three'] ] )
#print("\n")
print( data_df.iloc[2:, [3, 0, 1] ] ) # using number instead of labels
#print( data_df.iloc[:])
#print ( data_df.iloc[ :3 , :3 ] )
#print( data_df.iloc[:, :3])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          four  one  two
Utah        11    8    9
New York    15   12   13

# Arithmetic and Data Alignment¶

In [33]:
#print(list('bcd'))
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                   columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

print(df1)
print(df2)
print()
# applying plus operation between two data frames
df3 = df1 + df2

print(df3)
# your work is to fill all Nan values of  this df3 with a number, 
# choice of number is yours

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

# Deleting data (row or column from dataframe)¶

In [34]:
import numpy as np
import pandas as pd
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])
print(data_df)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")


#You can drop values from the columns by passing axis=1 
#or axis='columns' :
data_df = data_df.drop('two', axis=1)
#data_df.drop('two', axis=1, inplace = True)
print(data_df)

# if i want to remove a row for example 'Colorado', 
# how can we do that

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

# Indexing, Selection, and Filtering¶

In [36]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")
df2 = data_df[ ["one", "three"] ]
#print(df2)
#print( data_df[2:] ) # same like numpy
#print(data_df["one"] )# dicitonary like style of accessing data
#print(data_df.one[2:])  # filter on both row and column
# Conditonal Selection
#print ( data_df.three[data_df['three'] > 5] )
#print(data_df, "\n")

#f2 = data_df["three"] > 5  # boolean dataframe
#print(df2)
print( data_df[  data_df["three"] > 5  ] )

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# Sorting and Ranking

In [37]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
print(frame)
print()
print(frame.sort_index(axis=1, ascending=True))
print()
print( frame.sort_index())
# defaults in sort: axis = 0, ascending = True

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

# sort by values

In [39]:
print( frame.sort_values(by='b') )
print(frame.rank(ascending=False, method='max'))
print(frame.rank(ascending=True, method='min'))
print( frame.rank(axis='columns'))


#check details from the book
'''
'average' Default: assign the average rank to each entry in the equal group
'min'
'max'
'first'
'dense'
Use the minimum rank for the whole group
Use the maximum rank for the whole group
Assign ranks in the order the values appear in the data
Like method='min' , but ranks always increase by 1 in between groups rather than the number of equal
elements in a group
'''

       d  a  b  c
three  0  1  2  3
one    4  5  6  7
         d    a    b    c
three  2.0  2.0  2.0  2.0
one    1.0  1.0  1.0  1.0
         d    a    b    c
three  1.0  1.0  1.0  1.0
one    2.0  2.0  2.0  2.0
         d    a    b    c
three  1.0  2.0  3.0  4.0
one    1.0  2.0  3.0  4.0

"\n'average' Default: assign the average rank to each entry in the equal group\n'min'\n'max'\n'first'\n'dense'\nUse the minimum rank for the whole group\nUse the maximum rank for the whole group\nAssign ranks in the order the values appear in the data\nLike method='min' , but ranks always increase by 1 in between groups rather than the number of equal\nelements in a group\n"

# Summarizing and Computing Descriptive Statistics

In [40]:
df = pd.DataFrame([
                    [1.4, np.nan], [7.1, -4.5],
                    [np.nan, np.nan], [0.75, -1.3]
                   ], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
print(df)
print()
print( df.sum())
print()
print( df.sum(axis='columns'))
# note: use of skipna

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    9.25
two   -5.80
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [41]:
print(df)
x = df.mean(axis='columns', skipna=False)
print()
print(x)

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

# unique values

In [42]:
df = pd.DataFrame([
                    [1.4,1.4, 1.5, np.nan], [7.1, -4.5, 1.5, 1.4],
                    [1.4, np.nan, 0.5, np.nan], [0.75, -1.3, 1.3, np.nan]
                   ], index=['a', 'b', 'c', 'd'], columns=['one', 'two', 'three', 'four'])
print(df)
print()
print(df['one'].unique(), df['two'].unique() )
df['one'].value_counts()

#end of chapter 1

    one  two  three  four
a  1.40  1.4    1.5   NaN
b  7.10 -4.5    1.5   1.4
c  1.40  NaN    0.5   NaN
d  0.75 -1.3    1.3   NaN

[1.4  7.1  0.75] [ 1.4 -4.5  nan -1.3]

1.40    2
0.75    1
7.10    1
Name: one, dtype: int64